cask_args appdir: "/Applications"

tap "thoughtbot/formulae"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"


# Unix
brew "git"
brew "git-lfs"
brew "openssl"
brew "reattach-to-user-namespace"
brew "tmux"
brew "vim"
brew "zsh"
brew "tree"
brew "lsd"


# Tools
brew "ffmpeg"
brew "youtube-dl"
brew "pandoc"
brew "gnupg"
brew "mas"
brew "rsync"
brew "pv"
brew "tldr"
brew "wget"
brew "htop"
brew "watch"
brew "npm"
brew "pyenv"
brew "duti"

brew "httpie"
brew "jq"

# Cloud Native
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"

# Docker
cask "docker"
brew "docker-compose"

# Random applications
cask "iterm2"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "coconutbattery"
cask "db-browser-for-sqlite"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "sequel-pro"
cask "postico"
cask "skim"
cask "skitch"
cask "spotify"
cask "visual-studio-code"
cask "telegram"
cask "vlc"
cask "gpg-suite-no-mail"
cask "tor-browser
cask "musicbrainz-picard"
cask "plexamp"

# Quick Look Plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "readline"
brew "xz"
brew "ansible"
brew "packer"
brew "gettext"

# Fonts
cask "font-inconsolata-nerd-font"
cask "font-inconsolata"
cask "font-ibm-plex"
cask "font-fantasquesansmono-nerd-font"
