cask_args appdir: "/Applications"

tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/autoupdate"

# Unix
brew "git"
brew "git-lfs"
brew "openssl"
brew "reattach-to-user-namespace"
brew "tmux"
brew "vim"
brew "zsh"
brew "tree"
brew "lsd"

# Databases + tools
cask "postgres-unofficial"
cask "postico"
brew "redis"


# Tools
brew "imagemagick"
brew "pandoc"
brew "mas"
brew "rsync"
brew "pv"
brew "wget"
brew "curl"
brew "htop"
brew "watch"
brew "npm"
brew "duti"
brew "httpie"
brew "jq"
brew "shellcheck"
cask "slack"

# Python dev
brew "pyenv"
brew "pyenv-virtualenv"
brew "pre-commit"
brew "black"
brew "flake8"
brew "pipx"
brew "mypy"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
brew "stern"
brew "kubectx"
brew "k9s"

# Docker
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "colima"

# Random applications
cask "iterm2"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "db-browser-for-sqlite"
cask "firefox"
cask "google-chrome"
cask "visual-studio-code"
cask "gpg-suite-no-mail"
cask "rectangle"
cask "maccy"
cask "vlc"
cask "istat-menus"

# Programming language prerequisites and package managers
brew "openssl"
brew "libyaml" # should come after openssl
brew "readline"
brew "xz"
brew "gettext"

# Fonts
cask "font-ibm-plex"
cask "font-inconsolata-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
