brew "ansible"
brew "ffmpeg"
brew "flac"
brew "opus"
brew "restic"
brew "yt-dlp"

cask "calibre"
cask "coconutbattery"
cask "macpar-deluxe"
cask "mactex"
cask "makemkv"
cask "mediainfo"
cask "mediathekview"
cask "mkvtoolnix"
cask "moneymoney"
cask "musicbrainz-picard"
cask "openzfs"
cask "plexamp"
cask "postico"
cask "qlmarkdown"
cask "signal"
cask "skitch"
cask "spotify"
cask "telegram"
cask "tor-browser"
cask "vlc"
cask "tailscale"
